from main import *

START_SURVEY, NEXT, PREVIOUS, CONTINUE = (
    {'uz': 'Сўровномани бошлаш ✅', 'ru': 'Начать опрос ✅'},
    {'uz': 'Кейингиси ⏩', 'ru': 'Далее ⏩'},
    {'uz': '↩️ Оркага', 'ru': '↩️ Назад'},
    {'uz': 'Давом этиш ➡️️',
     'ru': 'Дальше ➡️'}
)

NATURAL_PERSON, ENTITY, INDIVIDUAL_ENTPRNR = (
    {'uz': "Жисмоний шахс",
     'ru': "Физическое лицо"},
    {'uz': "Юридик шаҳс",
     'ru': "Юридическое лицо"},
    {'uz': "Якка Тартибдаги Тадбиркор",
     'ru': "Частный предприниматель"}
)
ANDIJAN, BUKHARA, DJIZAK, KASHKADARYA, KARAKALPAKSTAN, NAVOI, NAMANGAN, SAMARKAND, SIRDARYA, SURKHANDARYA, \
    TASHKENT_REGION, TASHKENT, FERGANA, KHOREZM = (
        {'uz': 'Андижон вилояти',
         'ru': 'Андижанская область'},
        {'uz': 'Бухоро вилояти',
         'ru': 'Бухарская область'},
        {'uz': 'Жиззах вилояти',
         'ru': 'Джизакская область'},
        {'uz': 'Қашқадарё вилояти',
         'ru': 'Кашкадарьинская область'},
        {'uz': 'Қорақалпоғистон Республикаси',
         'ru': 'Республика Каракалпакстан'},
        {'uz': 'Навоий вилояти',
         'ru': 'Навоийская область'},
        {'uz': 'Наманган вилояти',
         'ru': 'Наманганская область'},
        {'uz': 'Самарқанд вилояти',
         'ru': 'Самаркандская область'},
        {'uz': 'Сирдарё вилояти',
         'ru': 'Сырдарьинская область'},
        {'uz': 'Сурхондарё вилояти',
         'ru': 'Сурхандарьинская область'},
        {'uz': 'Тошкент вилояти',
         'ru': 'Ташкентская область'},
        {'uz': 'Тошкент шаҳри',
         'ru': 'г. Ташкент'},
        {'uz': 'Фарғона вилояти',
         'ru': 'Ферганская область'},
        {'uz': 'Хоразм вилояти',
         'ru': 'Хорезмская область'})


AGROBANK, ASIA_ALLIANCE_BANK, ALOQABANK, ANORBANK, ASAKABANK, DAVRBANK, ZIRAATBANK, INFINBANK, IPAKYULIBANK, \
    IPOTEKABANK, KAPITALBANK, QQB, MADADINVESTBANK, MIKROKREDITBANK, OFB, POYTAXTBANK, RAVNAQBANK, SAVDOGARBANK, \
    TENGEBANK, TBCBANK, TRASTBANK, TURKISTONBANK, TURONBANK, UNIVERSALBANK, UZAGROBANK, UZKDB, UZMILLIYBANK, \
    UZSANOATQURILISHBANK, HITECHBANK, XALQBANKI, HAMKORBANK, ERONSODEROTBANK = (
        {'uz': 'Агробанк',
         'ru': 'Агробанк'},
        {'uz': 'Азия Альянс банк',
         'ru': 'Азия Альянс банк'},
        {'uz': 'Алоқа банк',
         'ru': 'Алока банк'},
        {'uz': 'Анор банк',
         'ru': 'Анор банк'},
        {'uz': 'Асака банк',
         'ru': 'Асака банк'},
        {'uz': 'Давр банк',
         'ru': 'Давр банк'},
        {'uz': 'Зираат банк',
         'ru': 'Зираат банк'},
        {'uz': 'Инвест Финанс банк',
         'ru': 'Инвест Финанс банк'},
        {'uz': 'Ипак Йўли банк',
         'ru': 'Ипак Йули банк'},
        {'uz': 'Ипотека-банк',
         'ru': 'Ипотека-банк'},
        {'uz': 'Капиталбанк',
         'ru': 'Капиталбанк'},
        {'uz': 'Қишлоқ қурилиш банк',
         'ru': 'Кишлок курилиш банк'},
        {'uz': 'Мадад инвест банк',
         'ru': 'Мадад инвест банк'},
        {'uz': 'Микрокредитбанк',
         'ru': 'Микрокредитбанк'},
        {'uz': 'Ориент Финанс банк',
         'ru': 'Ориент Финанс банк'},
        {'uz': 'Пойтахт банк',
         'ru': 'Пойтахт банк'},
        {'uz': 'Равнақ-банк',
         'ru': 'Равнак-банк'},
        {'uz': 'Савдогар банк',
         'ru': 'Савдогар банк'},
        {'uz': 'Тенге банк',
         'ru': 'Тенге банк'},
        {'uz': 'Тибиси банк - TBC',
         'ru': 'Тибиси банк - TBC'},
        {'uz': 'Траст банк',
         'ru': 'Трастбанк'},
        {'uz': 'Туркистон банк',
         'ru': 'Туркистон банк'},
        {'uz': 'Турон банк',
         'ru': 'Турон банк'},
        {'uz': 'Универсал банк',
         'ru': 'Универсал банк'},
        {'uz': 'Ўзагроэкспортбанк',
         'ru': 'Узагроэкспортбанк'},
        {'uz': 'ЎзКДБ банк',
         'ru': 'УзКДБ банк'},
        {'uz': 'Ўзмиллийбанк',
         'ru': 'Узнацбанк'},
        {'uz': 'Ўзсаноатқурилишбанк',
         'ru': 'Узпромстройбанк'},
        {'uz': 'Хай-Тек банк',
         'ru': 'Хай-Тек банк'},
        {'uz': 'Халқ банки',
         'ru': 'Народный банк'},
        {'uz': 'Ҳамкорбанк',
         'ru': 'Хамкорбанк'},
        {'uz': 'Эрон Содерот банк',
         'ru': 'Банк Садерат Ирана'})


REASON_RECOMMENDATION, REASON_SERVICE_CONDITIONS, REASON_QUALITY_SERVICE, REASON_CREDIT_AVAILABILITY, \
    REASON_BANK_POPULARITY, REASON_UNDERSTANDABLE_CONDITIONS, REASON_RELIABLE_BANK, REASON_BANK_OPERATIVES, \
    REASON_WIDE_RANGE, REASON_LOCATION, REASON_REMOTE, REASON_OTHER = (
        {'uz': "Тавсия қилишган",
         'ru': "По рекомендации"},
        {'uz': "Фойдали хизмат шартлари",
         'ru': "Выгодные условия обслуживания"},
        {'uz': "Юқори сифатда хизмат кўрсатилиши",
         'ru': "Высокое качество обслуживания"},
        {'uz': "Кредит маҳсулотларининг мавжудлиги",
         'ru': "Доступность кредитных продуктов"},
        {'uz': "Банкнинг таниқлилиги",
         'ru': "Популярность банка"},
        {'uz': "Содда ва тушунарли хизмат шартлари",
         'ru': "Понятные условия обслуживания"},
        {'uz': "Ишончли банк",
         'ru': "Надежность банка"},
        {'uz': "Хизматнинг тезкорлиги",
         'ru': "Оперативность обслуживания"},
        {'uz': "Банк кенг кўламдаги хизмат турлари тақдим қилаётганлиги",
         'ru': "Широкий спектр услуг, предоставляемых банком"},
        {'uz': "Филиалларнинг қулай жойлашуви",
         'ru': "Удобство расположения отделений"},
        {'uz': "Масофавий хизмат кўрсатишнинг мавжудлиги",
         'ru': "Доступность дистанционного банковского обслуживания"},
        {'uz': "Бошқа: матнни киритинг",
         'ru': "Другое: введите текст"})

EVERYDAY, ONCE_A_WEEK, ONCE_A_MONTH, DONT_GO, FREQ_OTHER = (
    {'uz': "Ҳар куни",
     'ru': "Ежедневно"},
    {'uz': "Ҳар ҳафтада бир",
     'ru': "Еженедельно"},
    {'uz': "Ҳар ойда бир",
     'ru': "Ежемесячно"},
    {'uz': "Банкка бормайман, банк мобиль иловасидан фойдаланаман",
     'ru': "Не посещаю банк, пользуюсь мобильным приложением"},
    {'uz': "Бошқа вақтда",
     'ru': "Другая частота"}
)

CREDIT, DEPOSIT, CARD, PAYMENT, EXCHANGE, TRANSFER, WITHDRAWAL, CHECKING_ACC, CONSULTING, CURRENCY_OP, \
    INTERNET_BANK, SERVICE_OTHER = (
        {'uz': "Кредитлар",
         'ru': "Кредиты"},
        {'uz': "Омонатлар – депозитлар",
         'ru': "Вклады – депозиты"},
        {'uz': "Банк карталари",
         'ru': "Банковские карты"},
        {'uz': "Тўловлар",
         'ru': "Платежи"},
        {'uz': "Валюта айирбошлаш",
         'ru': "Обмен валют"},
        {'uz': "Пул ўтказмалари",
         'ru': "Денежные переводы"},
        {'uz': "Нақд пул ечиш",
         'ru': "Снятие денежных средств"},
        {'uz': "Ҳисоб рақамларни очиш ва юритиш",
         'ru': "Открытие и ведение расчетного счета"},
        {'uz': "Консультатив хизматлар",
         'ru': "Консультативные услуги"},
        {'uz': "Валюта билан боғлиқ амалиётлар",
         'ru': "Валютные операции"},
        {'uz': "Интернет-банкинг",
         'ru': "Интернет-банкинг"},
        {'uz': "Бошқа",
         'ru': "Другое"})

GOOD, SATISFACTORY, DISSATISFACTORY, BAD, DONT_KNOW = (
    {'uz': "Яхши ⭐️⭐️⭐️⭐⭐️",
     'ru': "Хорошее ⭐️⭐️⭐️⭐⭐️"},
    {'uz': "Қониқарли ⭐️⭐️⭐️⭐️",
     'ru': "Удовлетворительное ⭐️⭐️⭐️⭐️"},
    {'uz': "Қониқарсиз ⭐️⭐️⭐️",
     'ru': "Неудовлетворительное ⭐️⭐️⭐️"},
    {'uz': "Ёмон ⭐️⭐️",
     'ru': "Плохое ⭐️⭐️"},
    {'uz': "Фойдаланмаганман/Жавоб беришга қийналаман 🤷‍♂️/🤷‍♀️",
     'ru': "Не пользовался/Затрудняюсь ответить 🤷‍♂️/🤷‍♀️"}
)

FULLY_DISSATISFIED, DISSATISFIED, SATISFIED, FULLY_SATISFIED, HARD_TO_ANSWER = (
    {'uz': "Умуман қониқарсиз",
     'ru': "Совершенно неудовлетворен"},
    {'uz': "Қониқарсиз️",
     'ru': "Неудовлетворен️"},
    {'uz': "Қониқарли️",
     'ru': "Удовлетворен"},
    {'uz': "️Жуда қониқарли",
     'ru': "Совершенно удовлетворен"},
    {'uz': "️Жавоб беришга қийналаман",
     'ru': "Затрудняюсь ответить️"}
)

FULLY_AGREE, MOSTLY_AGREE, MOSTLY_DISAGREE, FULLY_DISAGREE = (
    {'uz': "Тўлиқ қўшиламан 👍👍",
     'ru': "Полностью согласен 👍👍"},
    {'uz': "Қисман қўшиламан 👍",
     'ru': "Скорее согласен 👍"},
    {'uz': "Қисман қўшилмайман 👎",
     'ru': "Скорее не согласен 👎"},
    {'uz': "️Умуман қўшилмайман 👎👎",
     'ru': "Полностью не согласен 👎👎"}
)

LIKE, DONT_LIKE = (
    {'uz': "Менга ҳаммаси маъқул",
     'ru': "Мне всё нравится"},
    {'uz': "Менга ёқмайди...",
     'ru': "Мне не нравится..."}
)
NO_COMMENTS_BUTTON = {'uz': 'Изоҳ йўқ', 'ru': "Комментариев нет"}
