from main import *

start_text = "🇺🇿 Сўровномани ўтиш учун тилни танланг\n\n🇷🇺 Выберите язык для прохождения опроса"
greeting_txt = {
    'uz': """Ассалому алайкум,

Банкларда банк хизматларини кўрсатиш сифатини баҳолаш бўйича Ўзбекистон Республикаси Марказий банки томонидан ўтказилаётган сўровномага хуш келибсиз!

Сизнинг фикрларингиз банкларда хизмат кўрсатиш сифатини янада ошириш учун жуда муҳим!

Сиз тақдим этадиган маълумотлар (аноним) шаклда фақат хизмат доирасида умумлаштирилган ҳолда фойдаланилиши ва учинчи шахсларга ошкор қилинмаслиги Ўзбекистон Республикаси Марказий банки томонидан кафолатланади.
""",
    'ru': """Здравствуйте,
    
Добро пожаловать в опрос, проводимый Центральным банком Республики Узбекистан по оценке качества обслуживания в банках!

Ваше мнение очень важно для дальнейшего улучшения качества обслуживания в банках!

Центральный банк Республики Узбекистан гарантирует использование информации, представленной Вами в рамках данного опроса в обезличенной и обобщенной форме исключительно в служебных целях, а также не разглашение третьим лицам.
"""
}
start_survey_txt = {
    'uz': "Сўровномани бошлаш учун <b>“Сўровномани бошлаш”</b> тугмасини босинг",
    'ru': "Чтобы начать опрос, нажмите на кнопку <b>'Начать опрос'</b>"
}
identity_txt = {
    'uz': 'Сиз қуйида келтирилганлардан қайси бирига мансубсиз?',
    'ru': 'Какое из нижеперечисленных относится к <b>Вам</b>?'
}
region_txt = {
    'uz': "📍 Сизга хизмат кўрсатувчи банк жойлашган ҳудудни танланг\n<i>(фақат битта ҳудудни танланг)</i>",
    'ru': "📍 Выберите регион деятельности обслуживающего Вас банка\n<i>(выберите только один регион)</i>"
}
bank_txt = {
    'uz': "🏦 Сизга хизмат кўрсатувчи банкни танланг\n<i>(фақат битта банкни танланг)</i>",
    'ru': "🏦 Выберите обслуживающий Вас банк\n<i>(выберите только один банк)</i>"
}
reason_txt = {
    'uz': "Нима сабабдан Сиз ушбу банк хизматидан фойдаланасиз?\n<i>(бир нечта жавобни танлашингиз мумкин)</i>",
    'ru': "По каким причинам Вы выбрали для обслуживания этот банк?\n<i>(можете выбрать несколько вариантов)</i>"
}
multiple_choices_add = {
    'uz': """✅ Сиз <b>"{}"</b>ни қўшдингиз!

<b>📑 Сиз танлаганлар:</b>
{}

<i>Танловингиз охирида “Давом этиш”ни босинг</i>""",
    'ru': """✅ Вы добавили <b>"{}"</b>!
    
<b>📑 Вы выбрали следующие пункты:</b>
{}

<i>Когда закончите выбирать, нажмите кнопку "Дальше"</i>"""
}
multiple_choices_remove = {
    'uz': """❌ Сиз <b>"{}"</b>ни ўчирдингиз!

<b>📑 Сиз танлаганлар:</b>
{}

<i>Танловингиз охирида “Давом этиш”ни босинг</i>""",
    'ru': """❌ Вы удалили <b>"{}"</b>!
    
<b>📑 Вы выбрали следующие пункты:</b>
{}

<i>Когда закончите выбирать, нажмите кнопку "Дальше"</i>"""
}
multiple_choices_back = {
    'uz': """<b>📑 Сиз танлаганлар:</b>
{}

<i>Танловингиз охирида “Давом этиш”ни босинг</i>""",
    'ru': """<b>📑 Вы выбрали следующие пункты:</b>
{}

<i>Когда закончите выбирать, нажмите кнопку "Дальше"</i>"""
}
reason_other_txt = {
    'uz': "Ўзингизни фикрингизни ёзиб жўнатинг",
    'ru': "Отправьте своё сообщение"
}
frequency_txt = {
    'uz': "Сиз банкка тез-тез ташриф буюрасизми?",
    'ru': "Как часто Вы посещаете банк?"
}
other_frequency_txt = {
    'uz': "Бошқа қайси холларда Сиз банкга ташриф буюрасиз?",
    'ru': "В каких других случаях Вы посещаете банк?"
}
services_txt = {
    'uz': "Қайси банк хизматларидан Сиз тез-тез фойдаланасиз?\n<i>(бир нечта жавобни танлашингиз мумкин)</i>",
    'ru': "Какими банковским услугами (продуктами) Вы чаще всего пользуетесь?\n<i>(можете выбрать несколько вариантов)</i>"
}
service_other_txt = {
    'uz': "Ўзингизни фикрингизни ёзиб жўнатинг",
    'ru': "Отправьте своё сообщение"
}
rating_txt = {
    'uz': "Сиз фойдаланган банк <i>хизмати</i> бўйича қониқиш даражангизни баҳоланг\n\n<b>{}</b>",
    'ru': "Оцените, насколько Вы удовлетворены <i>качеством обслуживания</i> по услугам, которыми Вы пользовались?\n\n<b>{}</b>"
}
parameters_txt = {
    'uz': "Банкнинг қуйидаги <i>хизмат кўрсатиш параметрлари</i> Сизни қай даражада қониқтиришига қараб баҳоланг\n\n<b>{}</b>",
    'ru': "Оцените, насколько Вы удовлетворены перечисленными <i>параметрами обслуживания</i> в банке?\n\n<b>{}</b>"
}

PARAM_D_T, PARAM_F_T, PARAM_IA_T, PARAM_P_T = (
    {'uz': "Келишилган муддатларда ўз мажбуриятларини бажаради",
     'ru': "Соблюдение сроков предоставления услуг"},
    {'uz': "Мижозлар билан ўзаро ишлаш тизими мавжуд",
     'ru': "Наличие обратной связи с клиентом"},
    {'uz': "Банк хизматлари (маҳсулотлари) тўғрисидаги маълумотларни тўлиқ ва тушунарли тақдим этади",
     'ru': "Полнота и доступность предоставляемых информаций и консультаций"},
    {'uz': "Малакали мутахассис ходимларга эга",
     'ru': "Компетентность и профессионализм персонала"}
)

workers_txt = {
    'uz': "Сизга хизмат кўрсатган ходимнинг <i>хизмат кўрсатиш даражасини ва малакасини</i> баҳоланг\n\n<b>{}</b>",
    'ru': "Оцените <i>уровень обслуживания и компетентность</i> сотрудника, который Вас обслуживал\n\n<b>{}</b>"
}
WORKER_INF_T, WORKER_OP_T, WORKER_PROF_T, WORKER_POL_T, WORKER_RH_T = (
    {'uz': "Кўрсатилаётган хизматлар тўғрисида тўлиқ маълумотга эгалиги",
     'ru': "Информированность услугами, предоставляемыми банком"},
    {'uz': "Мижоз муаммоларига тезкор ечим топиши",
     'ru': "Оперативность в разрешении проблем клиентов"},
    {'uz': "Профессионаллиги",
     'ru': "Профессионализм"},
    {'uz': "Хушмуомалалиги",
     'ru': "Вежливость"},
    {'uz': "Ҳозиржавоблиги",
     'ru': "Готовность помочь (отзывчивость)"}
)

statements_txt = {
    'uz': "Сиз қуйида келтирилган фикрларга қанчалик қўшиласиз?\n\n<b>{}</b>",
    'ru': "Оцените, насколько Вы согласны со следующими утверждением?\n\n<b>{}</b>"
}
ST_NAVIGATION, ST_RESPONSIBILITY, ST_BANK_RESPONSE, ST_WORKER_INFO, ST_BANK_FAILS, ST_WORKER_OPERATIVE, ST_BANK_ADV,\
    ST_COMMISSION, ST_WIDE_RANGE, ST_CREDIT_GET, ST_APPCE, ST_GOOD_PR, ST_MOBILE, ST_ATM = (
        {'uz': "Банк ходимлари ташриф буюрувчиларни кутиб олади ва тўғри йўналиш беради",
         'ru': "При посещении банка сотрудники банка встречают и дают соответствующее направление"},
        {'uz': "Банк ўз зиммасига олган вазифаларни келишилган вақтда бажаради",
         'ru': "Банк выполняет взятые на себя обязательства в согласованные сроки"},
        {'uz': "Банк сўровларга бергиланган муддатларда жавоб беради",
         'ru': "Банк отзывается на запросы/ обращения в установленные сроки"},
        {'uz': "Банк ходимлари банк хизматлари (маҳсулотлари) тўғрисида тўлиқ ва тушунарли маълумот беради",
         'ru': "Сотрудники банка предоставляют полную и понятную информацию о банковских услугах (продуктах)"},
        {'uz': "Банк хизмат кўрсатишда хатолик ва ноаниқликларга йўл қўймайди",
         'ru': "Банк не допускает ошибки и неточности при обслуживании"},
        {'uz': "Банк ходимлари тез ва сифатли хизмат кўрсатади",
         'ru': "Сотрудники банка обслуживают  оперативно и качественно"},
        {'uz': "Банк хизматларни (маҳсулотларни) рақобатчиларига нисбатан қулайроқ шароитларда таклиф этади",
         'ru': "Банк предлагает более выгодные условия по услугам (продуктам) в сравнении с конкурентами"},
        {'uz': "Банк амалиётлари учун адолатли комиссия олади",
         'ru': "Банк взимает адекватные комиссии за операции"},
        {'uz': "Банк кенг хизматлар (маҳсулотлар) тармоғини таклиф этади",
         'ru': "Банк предлагает широкий спектр услуг (продуктов)"},
        {'uz': "Кредит олиш эҳтимоли бошқа банклардагидан юқори",
         'ru': "Вероятность получения кредита в банке выше, чем в прочих банках"},
        {'uz': "Банк жозибадор имиджга эга",
         'ru': "Банк имеет привлекательный имидж"},
        {'uz': "Банкнинг реклама ва PR-материаллари яхши таассурот қолдиради",
         'ru': "Рекламные и PR-материалы банка производят хорошее впечатление"},
        {'uz': "Банкнинг мобил иловаси фойдаланиш учун қулай",
         'ru': "Мобильное приложение банка удобно для использования"},
        {'uz': "Банкнинг банкоматлари тўхтовсиз ва техник носозликларсиз ишлайди",
         'ru': "Банкоматы банка работают бесперебойно"}
)

like_or_not_txt = {
    'uz': "Сизга банкнинг иш фаолияти маъқулми?",
    'ru': "Есть ли что-то, что Вам не нравится в работе банка?"
}
dont_like_txt = {
    'uz': "Сизни банкларда нима қониқтира олмаётганини ёзинг",
    'ru': "Напишите, что Вас не удовлетворяет в работе банков"
}
comment_txt = {
    'uz': "Банкнинг фаолиятига оид изоҳ, тилаклар ёки таклифларингиз мавжудми?",
    'ru': "Есть ли у Вас какие-либо комментарии, пожелания, предложения по деятельности банка?"
}
thankyou_txt = {
    'uz': "Сўровда иштирок этганингиз учун ташаккур! Сўров натижалари бўйича маълумот чорак якуни бўйича Ўзбекистон Республикаси Марказий банкнинг расмий веб-сайти ва ижтимоий тармоқлардаги саҳифалари орқали эълон қилинади.\n\nБошқа банкнинг фаолиятига ҳам баҳо бермоқчимисиз?\n\nСўровномани қайта ўтинг 👉/start",
    'ru': "Благодарим за участие в опросе! Данные о результатах опроса будут опубликованы по итогам квартала на официальном веб-сайте и страницах Центрального банка в социальных сетях.\n\nХотите оценить деятельность другого банка?\n\nТогда пройдите опрос заново 👉/start"
}